<h1><center> Data Analysis: Introduction to Pandas </center></h1>

<h2> Part IV. Merging files </h2>

<i>Example 1. Import the necessary libraries</i>

In [5]:
import pandas as pd
import numpy as np

<b>Exercise 1. Create the 3 dictionaries with the given attributes like the followings:</b><br>

|<b></b>|<b></b>|
|---|---|
|<b><center>data1</center></b><img src="data1.png" alt="student" style="width:3cm;height:4cm" />|<b><center>data2</center></b><img src="data2.png" alt="student" style="width:3cm;height:2.5cm" />|
|<b><center>data3</center></b><img src="data3.png" alt="student" style="width:2.25cm;height:3.75cm" />|<b><center>data4</center></b><img src="data4.png" alt="student" style="width:3cm;height:4cm" />|

In [25]:
students2 = {
    "student_id": [11, 12, 13, 14, 15],
    "first_name": ["John", "Frank", "James", "Tom", "Jennifer"],
    "last_name": ["Bond", "Little", "Collar", "Brune", "Stone"]
}

students1 = {
    "student_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "first_name": ["Mony", "Nana", "Ray", "Alice", "Ratanak", "Nara", "Ratana", "Roth", "Rith", "Johnny"],
    "last_name": ["Sopheak", "Tanaka", "Allen", "May", "Sam", "Kun", "Vann", "Sovann", "Harrison", "Cole"]
}

subjects = {
    "subject_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "subject_name": ["Math", "Geography", "History", "Literature", "Research", "IT", "Moral", "Art", "Earth Science", "Physics"]
}

test_scores = {
    "student_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "subject_id": [1, 3, 7, 8, 5, 4, 2, 7, 1, 6],
    "test_score": [55, 75, 65, 93, 76, 80, 77, 81, 63, 89]
}

<b>Exercise 2. Create the 3 DataFrames from the dictionaries.</b>

In [26]:
students_df1 = pd.DataFrame(students1)
students_df2 = pd.DataFrame(students2)
subjects_df = pd.DataFrame(subjects)
test_scores_df = pd.DataFrame(test_scores)

<b>Exercise 3. Concat data1 and data2 Dataframes placing the data2 under data1.</b>

In [27]:
students_df = pd.concat([students_df1, students_df2])
students_df.head(15)

   student_id first_name last_name
0           1       Mony   Sopheak
1           2       Nana    Tanaka
2           3        Ray     Allen
3           4      Alice       May
4           5    Ratanak       Sam
5           6       Nara       Kun
6           7     Ratana      Vann
7           8       Roth    Sovann
8           9       Rith  Harrison
9          10     Johnny      Cole
0          11       John      Bond
1          12      Frank    Little
2          13      James    Collar
3          14        Tom     Brune
4          15   Jennifer     Stone

<b>Exercise 4. Concat data1 and data2 Dataframes placing the data2 on the right side of data1.</b>

In [13]:
students_df_right_concat = pd.concat([students_df1, students_df2], axis=1)
students_df_right_concat.head(15)

   student_id first_name last_name  student_id first_name last_name
0           1       Mony   Sopheak        11.0       John      Bond
1           2       Nana    Tanaka        12.0      Frank    Little
2           3        Ray     Allen        13.0      James    Collar
3           4      Alice       May        14.0        Tom     Brune
4           5    Ratanak       Sam        15.0   Jennifer     Stone
5           6       Nara       Kun         NaN        NaN       NaN
6           7     Ratana      Vann         NaN        NaN       NaN
7           8       Roth    Sovann         NaN        NaN       NaN
8           9       Rith  Harrison         NaN        NaN       NaN
9          10     Johnny      Cole         NaN        NaN       NaN

<b>Exercise 5. Merge the result in <i>Exercise 3</i> with data4 and display the result.</b>

In [28]:
merged_df = students_df.merge(test_scores_df)
merged_df.head(15)

   student_id first_name last_name  subject_id  test_score
0           1       Mony   Sopheak           1          55
1           2       Nana    Tanaka           3          75
2           3        Ray     Allen           7          65
3           4      Alice       May           8          93
4           5    Ratanak       Sam           5          76
5           6       Nara       Kun           4          80
6           7     Ratana      Vann           2          77
7           8       Roth    Sovann           7          81
8           9       Rith  Harrison           1          63
9          10     Johnny      Cole           6          89

<b>Exercise 6. How many points does Johnny Cole get in the test? Display the information, score and subjects of Johnny Cole.</b>

In [34]:
merged_df = merged_df.merge(subjects_df)
# merged_df.head(15)

Johnny_result = merged_df[(merged_df['first_name'] == 'Johnny') & (merged_df['last_name'] == 'Cole')]
print(f"Johnny Cole scored {Johnny_result["test_score"].iloc[0]} in his test")
Johnny_result.head()

Johnny Cole scored 89 in his test

Johnny Cole scored 89 in his test

   student_id first_name last_name  subject_id  test_score subject_name
9          10     Johnny      Cole           6          89           IT

<b>Exercise 7. Which subject does Nara Kun take the test on? Display the information, score and subjects of Nara Kun.

In [33]:
Nara_result = merged_df[(merged_df['first_name'] == 'Nara') & (merged_df['last_name'] == 'Kun')]
print(f"Nara took the test for the subject {Nara_result["subject_name"].iloc[0]}")
Nara_result.head()

Nara took the test for the subject Literature

Nara took the test for the subject Literature

   student_id first_name last_name  subject_id  test_score subject_name
5           6       Nara       Kun           4          80   Literature

<b>Exercise 8. Which subject does Mony Sopheak and James Collar take the test on? Display the information, score and subjects of the two students.

In [ ]:
Mony_James_result = merged_df[((merged_df['first_name'] == 'Mony') & (merged_df['last_name'] == 'Sopheak')) | ((merged_df['first_name'] == 'James') & (merged_df['last_name'] == 'Collar'))]

Mony_James_result.head()

IndexError: single positional indexer is out-of-bounds